test/foundationdb/sqlite/use_cache/a/out_run.txt
normal
amd64
/lib/linux/amd64/libfdb_c.so
amd64
/lib/linux/amd64/libfdb_java.so
cleanup here
[OVERALL], RunTime(ms), 1786
[OVERALL], Throughput(ops/sec), 111.98208286674132
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 99
[READ], AverageLatency(us), 2402.3535353535353
[READ], MinLatency(us), 1688
[READ], MaxLatency(us), 4823
[READ], 95thPercentileLatency(us), 3175
[READ], 99thPercentileLatency(us), 3375
[READ], Return=OK, 99
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 148672.0
[CLEANUP], MinLatency(us), 148608
[CLEANUP], MaxLatency(us), 148735
[CLEANUP], 95thPercentileLatency(us), 148735
[CLEANUP], 99thPercentileLatency(us), 148735
[UPDATE], Operations, 101
[UPDATE], AverageLatency(us), 9713.009900990099
[UPDATE], MinLatency(us), 5828
[UPDATE], MaxLatency(us), 36927
[UPDATE], 95thPercentileLatency(us), 14111
[UPDATE], 99thPercentileLatency(us), 19871
[UPDATE], Return=OK, 101